# Ваш колега мав написати просту допоміжну функцію для написання великої літери рядка (що містить одне слово) перед тим, як вони пішли у відпустку.
#
# На жаль, вони вже пішли, і код, який вони вам дали, не працює. Виправте допоміжну функцію, яку вони написали, щоб вона працювала належним чином (тобто вона повинна бути першим символом у верхньому регістрі рядка).
#
# Рядок завжди починається з літери і ніколи не буде порожнім.
#
# приклади:
#
# "hello" --> "Hello"
# "Hello" --> "Hello" (the first letter was already capitalized)
# "a"     --> "A"
my_string = input("Введіть будь ласка строку\n")
capitalize_string = my_string.capitalize()

print(capitalize_string)