# Наша футбольна команда завершила чемпіонат.
#
# Кожен матч представлено рядком у форматі "x:y", де x– рахунок нашої команди,
# а y– рахунок наших суперників.
#
# якщо x > y:(перемога)
# якщо x < y:(програш)
# якщо x = y:(нічия)


x = int(input("Ведіть будь ласка рахунок вашої команди\n"))
y = int(input("Ведіть будь ласка рахунок команди противника\n"))


if x > y:
    print("Ваша команда виграла!!!")
elif x == y:
    print("Результат матчу – нічия!!!")
elif x < y:
    print("Ваша команда програла!")





