# Вхідні дані: Два рядки, що представляють вибір Гравця 1 і Гравця 2.
# Вихідні дані:
# "Гравець 1 виграв!", якщо вибір Гравця 1 перемагатиме вибір Гравця 2.
# "Гравець 2 виграв!", якщо вибір Гравця 2 перемагатиме вибір Гравця 1.
# "Нічия!", якщо обидва вибори однакові.
# Ось логіка:
#
# Ножиці б'ють Папір
# Папір б'є Камінь
# Камінь б'є Ножиці
user_input = input("Ти вмієш грати камінь-ножиці-папір?\n")


if user_input == "так":
    print("Вам не потрібно пояснювати правила.")
else:
    print("Правила гри полягають в тому: "
        "1) Якщо Гравець 1 вибирає камінь і Гравець 2 вибирає ножиці, виграє Гравець 1. "
        "2) Якщо Гравець 1 вибирає ножиці і Гравець 2 вибирає папір, виграє Гравець 1. "
        "3) Якщо Гравець 1 вибирає папір і Гравець 2 вибирає камінь, виграє Гравець 1. "
        "4) Якщо вибір Гравця 1 і Гравця 2 однаковий, оголошується нічия. "
        "5) В іншому випадку виграє Гравець 2.")


user_input_1 = input("Гравець номер 1 вибери 1 з 3 пунктів (Камінь, Ножиці, Папір).\n")
user_input_2 = input("Гравець номер 2 вибери 1 з 3 пунктів (Камінь, Пожиці, Папір).\n")


if user_input_1 == "Камінь" and user_input_2 == "Папір":
    print("Гравець 2 виграв!!!")
elif user_input_1 == "Папір" and user_input_2 == "Ножиці":
    print("Гравець 2 виграв!!!")
elif user_input_1 == "Ножиці" and user_input_2 == "Камінь":
    print("Гравець 2 виграв!!!")
elif user_input_2 == "Камінь" and user_input_1 == "Папір":
    print("Гравець 1 виграв!!!")
elif user_input_2 == "Папір" and user_input_1 == "Ножиці":
    print("Гравець 1 виграв!!!")
elif user_input_2 == "Ножиці" and user_input_1 == "Камінь":
    print("Гравець 1 виграв!!!")
elif user_input_1 == "Ножиці" and user_input_2 == "Ножиці":
    print("Нічия!!!")
elif user_input_1 == "Камінь" and user_input_2 == "Камінь":
    print("Нічия!!!")
elif user_input_1 == "Папір" and user_input_2 == "Папір":
    print("Нічия!!!")